Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: This can be done via LoadPicture and SendMessage; for example:
ja: これは、LoadPictureと SendMessageで行うことができます；例えば、：

source: This can be done via the script's tray icon or the Reload function, which you can call from a hotkey.
ja: これは、スクリプトのトレイアイコンや、ホットキーから呼び出せるリロード機能で行うことができます。

source: This can be fixed by deleting the following registry key:
ja: 以下のレジストリキーを削除することで、改善されます：

source: This can be important if it frees other resources which are not automatically reclaimed by the operating system, such as temporary files.
ja: これは、一時ファイルなど、オペレーティング・システムによって自動的に取り戻されない他のリソースを解放する場合に重要な意味を持つ。

source: This can be just about any single character from the keyboard or one of the key names from the key list, such as a mouse/joystick button.
ja: これは、キーボードから任意の1文字、またはマウス/ジョイスティックボタンのようなキーリストのキー名の1つであることができます。

source: This can be just about any single character from the keyboard or one of the key names from the key list.
ja: キーボードの任意の1文字、またはキーリストのキー名のいずれかを指定することができます。

source: This can be omitted if the top-level item does not contain a menu (rare).
ja: 最上位のアイテムにメニューがない場合（稀）には省略可能です。

source: This can be overridden by using the - (left-align) and 0 (zero prefix) flags.
ja: これは、-（左寄せ）および0（ゼロプレフィックス）フラグを使用することで上書きすることができます。

source: This can be overridden with the /CP command line switch, as before.
ja: これは、従来通り、/CPコマンドラインスイッチで上書きすることができます。

source: This can be overridden with the L option, and there is no absolute maximum.
ja: これはLオプションで上書きすることができ、絶対的な最大値は存在しません。

source: This can be safely assigned to a variable, passed to a function or concatenated with another string.
ja: これを安全に変数に代入したり、関数に渡したり、別の文字列と連結したりすることができる。

source: This can be suppressed or handled with try/catch.
ja: これを抑制したり、try/catchで処理することができる。

source: This can be undone or overridden by passing a mutually-exclusive option; for example, C0 and C1 override C.
ja: これは、相互に排他的なオプションを渡すことによって、元に戻したり上書きしたりすることができます。例えば、C0と C1はCを上書きします。

source: This can be unset or omitted, if Target is not a plain memory address and if the buffer size is known to be sufficient, such as if the buffer was allocated based on a previous call to StrPut with the same String and Encoding.
ja: Targetがプレーン・メモリ・アドレスでなく、バッファ・サイズが十分であることが分かっている場合（同じStringと Encodingを持つStrPutの以前の呼び出しに基づいてバッファが割り当てられた場合など）、これは設定されないか省略される。

source: This can be unset or omitted, if the string is null-terminated.
ja: 文字列がヌル終端である場合、これは設定しないか省略することができる。

source: This can be used even with primitive values or to identify COM wrapper objects.
ja: これは、プリミティブ値やCOMラッパー・オブジェクトの識別にも使用できます。

source: This can be used for callbacks where the additional parameters are not needed.
ja: これは、追加パラメータが不要なコールバックに使用することができます。

source: This can be used in combination with /script to execute external scripts.
ja: これは、外部スクリプトを実行するために/scriptと組み合わせて使うことができる。

source: This can be used in conjunction with ClipboardAll to save non-textual items such as pictures.
ja: ClipboardAllと併用することで、画像などテキスト以外のものを保存することができます。

source: This can be used to define a custom window, or graphical user interface (GUI), to display information or accept user input.
ja: これは、情報を表示したり、ユーザー入力を受け入れるためのカスタムウィンドウ、またはグラフィカルユーザーインターフェイス（GUI）を定義するために使用することができます。

source: This can be used to force any pending interruptions to occur at a specific place rather than somewhere more random.
ja: これは、保留中の中断をランダムな場所ではなく、特定の場所に強制的に発生させるために使用できる。

source: This can be used to pass the file name as a parameter to any PostExec directives which need to access the generated .exe.
ja: これは、生成された .exe にアクセスする必要のあるPostExecディレクティブのパラメータとしてファイル名を渡すために使われます。

source: This can be used to perform common initialization tasks for each subclass, or modify subclasses in some way before they are used.
ja: これは、各サブクラスに対して共通の初期化タスクを実行したり、サブクラスを使用する前に何らかの方法で修正したりするために使用できます。

source: This can be used to provide context to the event handlers, or share values between them.
ja: イベントハンドラにコンテキストを提供したり、イベントハンドラ間で値を共有するために使用することができます。

source: This can be used to retrieve the IPart or IConnector interface of the Connector.
ja: コネクタのIPartまたはIConnectorインタフェースを取得するために使用できます。

source: This can be used when writing a non-contiguous sequence of numbers, such as in a structure for use with DllCall, where some fields are not being set.
ja: DllCallで使用する構造体のように、一部のフィールドが設定されていない、連続しない数値列を記述する場合に使用できます。

source: This can be used with DllCall or ComCall output parameters of type "Ptr*" or "PtrP" to ensure the pointer will be released automatically, such as if an error occurs.
ja: DllCallや ComCallの "Ptr*"や"PtrP"型の出力パラメータで使用することで、エラー発生時などにポインタが自動的に解放されるようにすることができます。

source: This can be used with functions that expect something like "TCHAR **" or "LPTSTR *".
ja: これは、「TCHAR **」や「LPTSTR *」のようなものを期待する関数で使用することができます。

source: This can be used with zero-width assertions such as (?<=a).
ja: これは、(?<=a)のようなゼロ幅のアサーションで使用することができます。

source: This can be useful for patterns in which only one of a collection of identically-named subpatterns can match.
ja: これは、同じ名前のサブパターンのコレクションのうち、1つだけがマッチするようなパターンに便利である。

source: This can be useful in combination with OnChar, OnKeyDown, KeyOpt or EndKeys.
ja: OnChar、OnKeyDown、KeyOptと組み合わせて使用すると便利です。 EndKeys.

source: This can be useful when file names or other strings that might contain an ampersand (&) must be displayed within a text control.
ja: これは、ファイル名やアンパサンド（&）を含む文字列をテキストコントロール内に表示しなければならない場合に便利である。

source: This can be utilized to test for the existence of a hotstring.
ja: これは、ホットストリングの存在をテストするために利用することができます。

source: This can be worked around by 1) compiling the script with the Ahk2Exe ConsoleApp directive, or 2) capturing the script's output via piping or redirection.
ja: これは、1）Ahk2Exe ConsoleAppディレクティブでスクリプトをコンパイルするか、2）パイプやリダイレクトでスクリプトの出力をキャプチャすることで回避することができます。

source: This can be worked around by 1) compiling the script with the Ahk2Exe ConsoleApp directive, or 2) piping a script's output to another command or program.
ja: これは、1）Ahk2Exe ConsoleAppディレクティブでスクリプトをコンパイルする、または2）スクリプトの出力を他のコマンドやプログラムにパイプすることで回避することができます。

source: This can happen when a function does not directly generate an exception but yields something inappropriate, such as a bad pointer or a string that is not terminated.
ja: これは、関数が直接例外を発生させないが、不正なポインタや終端していない文字列など、不適切なものを生成する場合に起こる可能性がある。

source: This can help debug a script.
ja: これは、スクリプトのデバッグに役立ちます。

source: This can improve a script's readability and maintainability.
ja: これにより、スクリプトの可読性と保守性が向上する。

source: This can improve reliability in cases where the image as a whole varies, but certain parts within it are always the same.
ja: これにより、画像全体が変化しても、その中のある部分は常に同じであるような場合の信頼性を向上させることができます。

source: This can prevent unwanted triggerings of hotstrings.
ja: これにより、ホットストリングの不要なトリガーを防ぐことができます。

source: This cannot be a dynamic variable.
ja: これは動的な変数ではありえない。

source: This cannot be done with something like if (A_AhkVersion <= "1.1.33") because a syntax error elsewhere in the script would prevent it from executing.
ja: これは、if (A_AhkVersion <= "1.1.33")のように、スクリプト内の他の場所で構文エラーが発生すると実行できなくなるため、実行できません。

source: This case is not supported by GetMethod.
ja: このケースはGetMethodではサポートされていません。

source: This causes RegExMatch and RegExReplace to throw an exception; the Extra property of the exception object contains the error code.
ja: これにより、RegExMatchとRegExReplaceは例外をスローします。例外オブジェクトのExtraプロパティにはエラー・コードが含まれます。

source: This causes a period (.) to match all characters including newlines (normally, it does not match newlines).
ja: これにより、ピリオド（.）は改行を含むすべての文字にマッチするようになる（通常は改行にはマッチしない）。

source: This causes the match to stop at the first '>' and thus it matches only the first tag <em>.
ja: これにより、マッチは最初の「>」で止まり、最初のタグ<em>にマッチする。

source: This causes the selection to jump to the nearest matching item.
ja: これにより、選択項目は最も近い一致項目にジャンプする。

source: This causes the selection to jump to the nearest matching row.
ja: これにより、選択範囲は最も近い一致する行にジャンプします。

source: This changes which indices are valid, but Has will show that the new elements have no value.
ja: これにより、有効なインデックスが変わりますが、Hasは新要素に価値がないことを示します。

source: This character is at the upper left corner of most English keyboards.
ja: この文字はほとんどの英語キーボードの左上にある。

source: This code is accessible to any program that spawned the script, such as another script (via RunWait) or a batch (.bat) file.
ja: このコードは、他のスクリプト（RunWait経由）やバッチ（.bat）ファイルなど、スクリプトを生成したすべてのプログラムからアクセスできます。

source: This color change can be avoided by freezing the icon, which is achieved by specifying 1 for the last parameter of TraySetIcon.
ja: この色の変化は、TraySetIconの最後のパラメータに1を指定することで、アイコンを凍結することで回避することができます。

source: This color is black in the default color scheme.
ja: この色はデフォルトの配色では黒である。

source: This color is gray in the default color scheme.
ja: この色はデフォルトの配色ではグレーである。

source: This color is white in the default color scheme.
ja: この色はデフォルトの配色では白である。

source: This condition can be detected by monitoring the WM_DESTROY message with OnMessage.
ja: この状態は、OnMessageでWM_DESTROYメッセージを監視することで検出することができます。

source: This conversion may be necessary even on AutoHotkey 64-bit, because results from 32-bit windows are zero-extended.
ja: AutoHotkeyの64bit版でも、32bitウィンドウの結果はゼロ拡張されるため、この変換が必要な場合があります。

source: This copy is destroyed by the system when the script exits, leaving other scripts unable to access it.
ja: このコピーは、スクリプトが終了するときにシステムによって破棄され、他のスクリプトはアクセスできない状態になります。

source: This count should not include the implicit this parameter.
ja: このカウントには、暗黙のthisパラメータを含めてはなりません。

source: This creates a Map, or associative array.
ja: これはMapまたは連想配列を作成する。

source: This creates an Array, which represents a list of items, numbered 1 and up.
ja: これはArray（配列）を作成するもので、1番から上の項目のリストを表す。

source: This creates an ad hoc Object.
ja: これにより、アドホック・オブジェクトが作成される。

source: This creates an EXE file of the same base filename as the script, which appears after a short time in the same directory.
ja: これにより、スクリプトと同じベースファイル名のEXEファイルが作成され、しばらくすると同じディレクトリに現れる。

source: This default can be changed to instead launch either v1 or v2.
ja: このデフォルトは、v1またはv2のいずれかを起動するように変更できる。

source: This default can be overridden by using #Include Dir as described below.
ja: このデフォルトは、後述の#Include Dirを使用することで上書きすることができます。

source: This defines a function which can be executed by name with a function call or function call statement.
ja: これは、関数コールまたは関数コールステートメントで名前を指定して実行できる関数を定義します。

source: This delay also occurs after the movement of the mouse during the drag operation.
ja: この遅延は、ドラッグ操作の際のマウスの移動後にも発生します。

source: This did not work in v1 as these operators were replaced with && or || at load time.
ja: v1では、これらの演算子はロード時に&&や ||に置き換えられるため、これは機能しませんでした。

source: This differs from v1, where they treated an empty variable as 0 when used standalone, but not mid-expression or with multi-statement comma.
ja: これは、v1とは異なり、空の変数を単独で使用した場合は0として扱い、式の途中や複数文のカンマを使用した場合は0として扱わないというものです。

source: This directive can be present many times and will be executed in the order encountered by the compiler, in the appropriate queue as specified by the When parameter.
ja: このディレクティブは何度も指定することができ、Whenパラメータで指定された適切なキューで、コンパイラが見つけた順番に実行される。

source: This directive can be specified many times if necessary, but only in the top level script file (i.e. not in an #Include file).
ja: このディレクティブは、必要であれば何度でも指定できるが、トップレベルのスクリプトファイルでのみ指定する（つまり、#Includeファイルでは指定しない）。

source: This directive does not cause the reading of clipboard data to be reattempted if the first attempt fails.
ja: 本指令は、クリップボードデータの読み出しに失敗した場合、再試行することはない。

source: This directive does not affect the Hotkey or Hotstring functions, for which the S hotkey option or S hotstring option can be used instead.
ja: この指令はHotkeyや Hotstringの機能には影響しませんが、代わりにS hotkeyオプションや S hotstringオプションが使用できます。

source: This directive is for specialised use only.
ja: 本指令は特殊用途にのみ適用される。

source: This directive is ignored if it appears in a script inserted by the AddResource directive.
ja: このディレクティブは、AddResourceディレクティブによって挿入されたスクリプトの中に現れると無視されます。

source: This directive is ignored when any of the following command line switches are used:
ja: このディレクティブは、以下のコマンドラインスイッチのいずれかが使用されている場合、無視されます。

source: This directive is ignored when any of the following command line switches are used: /force /restart
ja: このディレクティブは、以下のコマンドラインスイッチのいずれかが使用されている場合、無視されます：/force /restart

source: This directive is positional and affects all AddResource directives that follow it.
ja: このディレクティブは位置指定であり、それに続くすべてのAddResourceディレクティブに影響します。

source: This directive is positional:
ja: この指令は位置指定：

source: This directive is positional: it affects all hotkeys and hotstrings between it and the next #InputLevel directive.
ja: このディレクティブは次の#InputLevelディレクティブまでの間にあるすべてのホットキーとホットストリングに影響します。

source: This directive is rarely used because this type of buffering usually does more harm than good.
ja: 通常、この種のバッファリングは良いことよりも悪いことの方が多いので、このディレクティブが使われることはほとんどありません。

source: This directive is rarely used because this type of buffering, which is OFF by default, usually does more harm than good.
ja: このタイプのバッファリングはデフォルトでOFFになっており、通常、良いことよりも悪いことの方が多いため、このディレクティブはほとんど使用されません。

source: This directive may be overridden by a Resource ID specified in the GUI or CLI.
ja: このディレクティブは、GUIまたはCLIで指定されたリソースIDによって上書きされる。

source: This directive may be overridden by a base file parameter specified in the GUI or CLI.
ja: このディレクティブは、GUIまたはCLIで指定されたベースファイルのパラメータによって上書きされる可能性があります。

source: This distinction is made because objects share several common traits in contrast to primitive values:
ja: これは、原始的な価値観とは対照的に、オブジェクトにはいくつかの共通した特徴があるため、このような区別がなされています：

source: This document contains some topics which are sometimes important when dealing with external libraries or sending messages to a control or window.
ja: 本書では、外部ライブラリとの連携や、コントロールやウィンドウへのメッセージ送信の際に重要となるトピックをいくつか紹介します。

source: This document covers some general concepts and conventions used by AutoHotkey, with focus on explanation rather than code.
ja: この文書では、AutoHotkeyで使用される一般的な概念と慣習を、コードよりも説明に重点を置いて説明しています。

source: This document describes the language and also tries to point out common pitfalls.
ja: 本書では、その言語について説明するとともに、よくある落とし穴を指摘するようにしています。

source: This document details changes between AutoHotkey v1.0 and v1.1 that may cause scripts to behave differently, and therefore might be important to keep in mind while reading or updating old code.
ja: この文書では、AutoHotkey v1.0とv1.1の間の変更点を詳細に説明します。この変更により、スクリプトの動作が異なる場合がありますので、古いコードを読んだり更新したりする際に覚えておくことが重要かもしれません。

source: This documentation is for v2, so choose that option or switch to the v1 documentation.
ja: このドキュメントはv2用なので、そのオプションを選択するか、v1のドキュメントに切り替えてください。

source: This does not necessarily mean you should add ObjAddRef(value) when updating old scripts, as many scripts used the old function incorrectly.
ja: これは、古いスクリプトを更新する際に、ObjAddRef(value)を追加する必要があるとは限らず、多くのスクリプトが古い関数を間違って使用していたためです。

source: This does not occur if the window is already active.
ja: ウィンドウがすでにアクティブになっている場合は発生しない。

source: This does not prevent the program from checking for messages while performing a sleep, delay or wait.
ja: これは、スリープ、ディレイ、ウェイトの実行中にプログラムがメッセージをチェックすることを妨げるものではありません。

source: This does not reduce the script's execution speed because such lines are merged in memory the moment the script launches.
ja: このような行は、スクリプトが起動した瞬間にメモリ上にマージされるため、スクリプトの実行速度が低下することはない。

source: This doesn't use an official method of sending keystrokes, but instead sends messages directly to the window that you specify.
ja: これは、キー操作を送信する公式な方法を使わず、指定したウィンドウに直接メッセージを送信します。

source: This eliminates the drudgery of searching and traversing the Start Menu.
ja: これにより、スタートメニューの検索や移動の手間が省ける。

source: This enables DBGp-based debuggers to get or set a specific item after listing them by invoking the enumerator.
ja: これにより、DBGpベースのデバッガは、列挙器を呼び出して項目をリストアップした後、特定の項目を取得または設定できるようになる。

source: This enables expressions like (x.y)[z]() to be used at the start of a line, and also allows multi-line expressions to start with a line like (( or (MyFunc(.
ja: これにより、(x.y)[z]()のような式を行頭で使用できるようになり、また、複数行の式を ((や(MyFunc(のように行で始めることもできる。

source: This enables scaling of dialogs, menus, tooltips and some other things.
ja: これにより、ダイアログやメニュー、ツールチップなどの拡大縮小が可能になります。

source: This encourages clarity and reserves the directive for future uses.
ja: これにより、明確化が促進されるとともに、将来の使用のためにディレクティブが予約されます。

source: This ensures Finally statements are executed and local variables are freed, which may allow __delete to be called for any objects contained by local variables.
ja: これによりFinally文が実行されてローカル変数が解放され、ローカル変数に含まれるオブジェクトに対して__deleteが呼び出される可能性があります。

source: This ensures finally statements are executed and local variables are freed, which may allow __delete to be called for any objects contained by local variables.
ja: これにより、finally文が実行され、ローカル変数が解放され、ローカル変数に含まれるオブジェクトに対して__deleteが呼び出される可能性があります。

source: This ensures consistent behaviour and permits both built-in and user-defined members to be detected, retrieved or redefined.
ja: これにより、一貫した動作が保証され、組み込みとユーザー定義の両方のメンバーを検出、検索、再定義することができます。

source: This ensures the X and Y coordinates always match up, and there is no caching to cause unexpected behaviour (such as A_CaretX/Y returning a value that's not in the current CoordMode).
ja: これにより、XとYの座標が常に一致し、予期せぬ動作（A_CaretX/Yが現在のCoordModeにない値を返すなど）を引き起こすキャッシュがないことが保証されます。

source: This error might also occur if the user lacks permission to access the file, or if AutoHotkey is 32-bit and the DLL is 64-bit or vice versa.
ja: このエラーは、ユーザーがファイルにアクセスする権限がない場合、またはAutoHotkeyが32ビットでDLLが64ビットの場合、またはその逆の場合にも発生することがあります。

source: This error page is what will be saved in place of Filename.
ja: このエラーページは、Filenameの代わりに保存されるものです。

source: This event is raised once for each item being deselected or selected, so can be raised multiple times in response to a single action by the user.
ja: このイベントは、選択解除や選択された項目ごとに1回発生するので、ユーザーの1回の操作に対して複数回発生させることができる。

source: This example assigns a new value to a property of the object contained by Banana.
ja: この例では、バナナに含まれるオブジェクトのプロパティに新しい値を割り当てている。

source: This example can be used to remove a reference to "AutoHotkey" in the generated .exe to disguise that it is a compiled AutoHotkey script:
ja: この例は、生成された.exeから「AutoHotkey」への参照を削除し、コンパイルされたAutoHotkeyスクリプトであることを偽装するために使用できます：

source: This example defines a hotkey that runs Notepad whenever you press Win+N.
ja: この例では、Win+Nを押すたびにメモ帳を実行するホットキーを定義しています。

source: This example is executed as follows:
ja: この例は、次のように実行されます：

source: This example launches Notepad.
ja: この例では、メモ帳を起動します。

source: This example makes the Ctrl+Alt+P hotkey equivalent to pressing Winamp's pause/unpause button:
ja: この例では、Ctrl+Alt+P ホットキーをWinampの一時停止/一時停止ボタンを押すのと同じにします：

source: This example may fail on Windows 11 or later, as it requires the classic version of Notepad.
ja: この例はクラシック版のメモ帳を必要とするため、Windows 11以降では動作しない可能性があります。

source: This example may fail on Windows 11 or later, as it requires the classic version of the command prompt.
ja: この例は、Windows 11以降では、コマンドプロンプトのクラシックバージョンを必要とするため、失敗する可能性があります。

source: This example may not work well with the new Notepad on Windows 11 or later.
ja: この例は、Windows11以降の新しいメモ帳ではうまく動作しないかもしれません。

source: This example retrieves the Color property of the object Banana.
ja: この例では、オブジェクトBananaのColorプロパティを取得します。

source: This example retrieves the value previously associated with (mapped to) the key "^".
ja: この例では、以前にキー"^"に関連付けられた（マップされた）値を取得する。

source: This example script makes the special 000 that appears on certain keypads into an equals key.
ja: このサンプル・スクリプトは、特定のキーパッドに表示される特殊な000をイコール・キーにする。

source: This example should be combined with example #2 before running it.
ja: この例は、実行する前に例#2との組み合わせが必要です。

source: This example should open a new Notepad window and then move it to fill a portion of the primary screen (¼ of its width and ½ its height).
ja: この例では、新しいメモ帳ウィンドウを開き、それを主画面の一部（幅の1/4、高さの1/2）を埋めるように移動させます。

source: This expression is evaluated when the key, mouse button or combination is pressed, or at other times when the program needs to know whether the hotkey is active.
ja: この式は、キー、マウスボタン、またはその組み合わせが押されたとき、またはプログラムがホットキーが有効かどうかを知る必要があるその他のときに評価されます。

source: This extended style also enables alpha-blended marquee selection on systems where it is supported.
ja: この拡張スタイルは、アルファブレンドされたマーキー選択がサポートされているシステムでも使用できます。

source: This extension can also be used with other editors, such as vim, neovim and Sublime Text 4.
ja: この拡張機能は、vim、neovim、Sublime Text 4などの他のエディターでも使用できる。

source: This extension only supports AutoHotkey v2, but can also detect v1 scripts and automatically switch over to a v1 extension if one is installed.
ja: この拡張機能はAutoHotkey v2のみをサポートしますが、v1スクリプトも検出でき、v1拡張機能がインストールされている場合は自動的にv1拡張機能に切り替わります。

source: This facilitates bitwise operations on 64-bit values.
ja: これにより、64ビット値に対するビット演算が容易になります。

source: This feature is intended to help debug scripts and hotkeys.
ja: この機能は、スクリプトやホットキーのデバッグに役立つことを目的としています。

source: This flag can be removed by using ComObjFlags.
ja: このフラグは、ComObjFlagsを使用することで削除することができます。

source: This flag may be ignored if the desktop theme overrides it.
ja: デスクトップテーマがこのフラグを上書きした場合、このフラグは無視される。

source: This forum contains many more scripts, but most scripts will not run as-is on AutoHotkey v2.0.
ja: このフォーラムには他にもたくさんのスクリプトがありますが、ほとんどのスクリプトはAutoHotkey v2.0ではそのままでは動作しません。

source: This function queries the object for its IDispatch interface; if one is returned, DispPtr is immediately released.
ja: この関数は、オブジェクトにIDispatchインターフェイスを問い合わせ、IDispatchインターフェイスが返された場合、DispPtrは直ちに解放されます。

source: This function will not work with applications that use non-standard menu bars.
ja: この機能は、標準以外のメニューバーを使用するアプリケーションでは動作しません。

source: This function affects the behavior of all windowing functions, e.g. WinExist and WinActivate.
ja: この関数は、WinExistや WinActivateなど、すべてのウィンドウ関数の動作に影響する。

source: This function allows the type of a value to be specified when passing it to a COM method.
ja: COM メソッドに値を渡す際に、値の型を指定することができる機能です。

source: This function attempts to read the first standard status bar on a window (Microsoft common control:
ja: この関数は、ウィンドウ上の最初の標準ステータスバーを読み込もうとする（Microsoft common control：

source: This function attempts to read the first standard status bar on a window (Microsoft common control: msctls_statusbar32).
ja: この関数は、ウィンドウ上の最初の標準ステータスバー（共通コントロール：msctls_statusbar32）を読み込もうとする。

source: This function attempts to update the appearance/contents of a window by informing the OS that the window's rectangle needs to be redrawn.
ja: この関数は、ウィンドウの矩形を再描画する必要があることをOSに通知することによって、ウィンドウの外観や内容を更新しようとします。

source: This function can be used in a sort callback.
ja: この関数はソートコールバックで使うことができる。

source: This function can be used to enhance performance when building a string by means of gradual concatenation.
ja: この関数は、漸進的な連結によって文字列を構築する際のパフォーマンスを向上させるために使用できる。

source: This function can be used to estimate whether a value supports a specific action.
ja: この機能は、ある値が特定のアクションをサポートしているかどうかを推定するために使用することができます。

source: This function can set a delay to be performed between each keystroke, and the duration of the keystroke (i.e. the delay between pressing and releasing the key).
ja: この機能は、各キーストロークの間に実行される遅延と、キーストロークの持続時間（つまり、キーを押してから離すまでの遅延）を設定できます。

source: This function cannot directly enable or disable hotstrings in scripts other than its own.
ja: この機能は、自分以外のスクリプトのホットストリングを直接有効にしたり無効にしたりすることはできません。

source: This function causes the first window that matches one of the group's window specifications to be activated.
ja: グループのウィンドウ指定に合致する最初のウィンドウをアクティブにする機能です。

source: This function considers anything convertible to text (e.g. HTML) to be text.
ja: この機能は、テキストに変換可能なもの（HTMLなど）をテキストとみなします。

source: This function does not test for the presence of a __Get or __Set meta-function.
ja: この関数は、__Getまたは__Setメタファンクションが存在するかどうかをテストするものではありません。

source: This function does nothing other than notify AutoHotkey to use (or not use) alternate user credentials for all subsequent uses of Run and RunWait.
ja: この関数は、その後のRunおよびRunWaitのすべての使用において、代替ユーザー認証情報を使用する（または使用しない）ことをAutoHotkeyに通知する以外に何も行いません。

source: This function downloads to a file.
ja: ファイルへダウンロードする機能です。
